jornvdl/BUG/lib/ESP32-BLE-Keyboard-GATT/BleKeyboardGATT.cpp
// Updated BLEKeyboard library base to 0.3.1 (1 oct 2021)
// Updated Custom part on 24 nov 2021
// ESP32-BLE-Keyboard used as base library, written by T-vK
//			https://github.com/T-vK/ESP32-BLE-Keyboard
//
// Added custom GATT profiles and editted library to use with BUG: Bluetooth Ultrasimple Gamepad
// Editten by Jorn van der Linden


#if defined(USE_NIMBLE)
#include <NimBLEDevice.h>
#include <NimBLEServer.h>
#include <NimBLEUtils.h>
#include <NimBLEHIDDevice.h>
#else
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEServer.h>
#include "BLE2902.h"
#include "BLEHIDDevice.h"
#endif // USE_NIMBLE
#include "HIDTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleKeyboardGATT.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define LOG_TAG ""
#else
  #include "esp_log.h"
  static const char* LOG_TAG = "BLEDevice";
#endif

/// Flags and values for communication over custom BLE characteristic
// KEYBIND CHARACTERISTIC
int keystroke;  // integer value corresponding to keybind

// INDICATOR CHARACTERISTIC
int colour[3];  // RGB colour value of the LEDs: each int in range 0x00~0xFF
int layout;     // integer representing layout of indicator leds

// TIMEOUT CHARACTERISTIC
int timeout;    // store integer value of timeout before sleep in seconds
bool rstTimer;	// general flag to reset timer when ANY characteristic is updated

// INFO CHARACTERISTIC
bool rstBUG;	 	// flag: reset to factory settings
bool identify; 	// flag: flash indicators to identify BUG
bool wasd;			// flag: when circulating, use WASD keybinds instead of arrows
bool keys[5];		// flag-array: select which keys to circulate. When all are zero, a custom key should be set.


// When new key is received, update global variable and acknowledge.
class keyCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *keyCharacteristic) {
    uint8_t *data = keyCharacteristic->getData();

    if (*data>0 && *data<256) {
      keystroke = *data;
   		rstTimer = true;
      keyCharacteristic->setValue(keystroke);
      //keyCharacteristic->notify(true); // Something like this to notify, test later.
    }
  }
};
// When new layout is received, update global variable and acknowledge.
class indicatorCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *indicatorCharacteristic) {
    uint8_t *data = indicatorCharacteristic->getData();
    colour[0] = *data;
    colour[1] = *(data+1);
    colour[2] = *(data+2);
    layout = *(data+3);

    int returnValue = (layout << 24) + (colour[2] << 16) + (colour[1] << 8) + colour[0];
    indicatorCharacteristic->setValue(returnValue);
    
    rstTimer = true;
  }
};
// When new timeout is received, update global variable and acknowledge.
class timeoutCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *timeoutCharacteristic) {
    uint8_t *data = timeoutCharacteristic->getData();
    if (*(data+1)>0 || *data > 0) {
      timeout = *data * 256 + *(data+1);
      timeoutCharacteristic->setValue(timeout);
      rstTimer = true;
    }
  }
};
// When state is received, check is reset (then do this) or call. Reply with (resetted) states.
class stateCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *stateCharacteristic) {
    uint8_t *data = stateCharacteristic->getData();

    if ((*data & 0x80) == 0x80) {					// Reset the BUG
    	rstBUG = true;
    }

    identify 	= (*data & 0x40) == 0x40;
    wasd 			= (*data & 0x20) == 0x20;
    keys[4]		= (*data & 0x10) == 0x10;
    keys[0]		=	(*data & 0x08) == 0x08;
    keys[1]		=	(*data & 0x04) == 0x04;
    keys[2]		=	(*data & 0x02) == 0x02;
    keys[3]		=	(*data & 0x01) == 0x01;
      
    rstTimer = true;

    int written = rstBUG * 128 + identify * 64 + wasd * 32 + keys[4] * 16 + keys[0] * 8 + keys[1] * 4 + keys[2] * 2 + keys[1];
    stateCharacteristic->setValue(written);
  }
};

// Newly added code below
// Used UUID's (https://www.uuidgenerator.net/)
#define ServiceUUID "0ba682ae-4f1f-4e9b-be2a-809c224540fd"
#define KeyUUID     "3e7f5770-d6b7-4709-9b4b-951c63f97aaa"
#define IndicUUID   "6f1f3ce2-cb88-4c5a-9ba1-6e19369b8bbb"
#define TimeoutUUID "6de0e9a1-7f07-4e64-81b0-a8ca334bcccc"
#define StateUUID   "99503c7d-6924-413c-bb7d-db7e913fbddd"

// Report IDs:
#define KEYBOARD_ID 0x01
#define MEDIA_KEYS_ID 0x02

static const uint8_t _hidReportDescriptor[] = {
  USAGE_PAGE(1),      0x01,          // USAGE_PAGE (Generic Desktop Ctrls)
  USAGE(1),           0x06,          // USAGE (Keyboard)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  // ------------------------------------------------- Keyboard
  REPORT_ID(1),       KEYBOARD_ID,   //   REPORT_ID (1)
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0xE0,          //   USAGE_MINIMUM (0xE0)
  USAGE_MAXIMUM(1),   0xE7,          //   USAGE_MAXIMUM (0xE7)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   Logical Maximum (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x08,          //   REPORT_COUNT (8)
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 1 byte (Reserved)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE (8)
  HIDINPUT(1),        0x01,          //   INPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x05,          //   REPORT_COUNT (5) ; 5 bits (Num lock, Caps lock, Scroll lock, Compose, Kana)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  USAGE_PAGE(1),      0x08,          //   USAGE_PAGE (LEDs)
  USAGE_MINIMUM(1),   0x01,          //   USAGE_MINIMUM (0x01) ; Num Lock
  USAGE_MAXIMUM(1),   0x05,          //   USAGE_MAXIMUM (0x05) ; Kana
  HIDOUTPUT(1),       0x02,          //   OUTPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 3 bits (Padding)
  REPORT_SIZE(1),     0x03,          //   REPORT_SIZE (3)
  HIDOUTPUT(1),       0x01,          //   OUTPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x06,          //   REPORT_COUNT (6) ; 6 bytes (Keys)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE(8)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM(0)
  LOGICAL_MAXIMUM(1), 0x65,          //   LOGICAL_MAXIMUM(0x65) ; 101 keys
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0x00,          //   USAGE_MINIMUM (0)
  USAGE_MAXIMUM(1),   0x65,          //   USAGE_MAXIMUM (0x65)
  HIDINPUT(1),        0x00,          //   INPUT (Data,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0),                 // END_COLLECTION
  // ------------------------------------------------- Media Keys
  USAGE_PAGE(1),      0x0C,          // USAGE_PAGE (Consumer)
  USAGE(1),           0x01,          // USAGE (Consumer Control)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  REPORT_ID(1),       MEDIA_KEYS_ID, //   REPORT_ID (3)
  USAGE_PAGE(1),      0x0C,          //   USAGE_PAGE (Consumer)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   LOGICAL_MAXIMUM (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x10,          //   REPORT_COUNT (16)
  USAGE(1),           0xB5,          //   USAGE (Scan Next Track)     ; bit 0: 1
  USAGE(1),           0xB6,          //   USAGE (Scan Previous Track) ; bit 1: 2
  USAGE(1),           0xB7,          //   USAGE (Stop)                ; bit 2: 4
  USAGE(1),           0xCD,          //   USAGE (Play/Pause)          ; bit 3: 8
  USAGE(1),           0xE2,          //   USAGE (Mute)                ; bit 4: 16
  USAGE(1),           0xE9,          //   USAGE (Volume Increment)    ; bit 5: 32
  USAGE(1),           0xEA,          //   USAGE (Volume Decrement)    ; bit 6: 64
  USAGE(2),           0x23, 0x02,    //   Usage (WWW Home)            ; bit 7: 128
  USAGE(2),           0x94, 0x01,    //   Usage (My Computer) ; bit 0: 1
  USAGE(2),           0x92, 0x01,    //   Usage (Calculator)  ; bit 1: 2
  USAGE(2),           0x2A, 0x02,    //   Usage (WWW fav)     ; bit 2: 4
  USAGE(2),           0x21, 0x02,    //   Usage (WWW search)  ; bit 3: 8
  USAGE(2),           0x26, 0x02,    //   Usage (WWW stop)    ; bit 4: 16
  USAGE(2),           0x24, 0x02,    //   Usage (WWW back)    ; bit 5: 32
  USAGE(2),           0x83, 0x01,    //   Usage (Media sel)   ; bit 6: 64
  USAGE(2),           0x8A, 0x01,    //   Usage (Mail)        ; bit 7: 128
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0)                  // END_COLLECTION
};

BleKeyboard::BleKeyboard(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) 
    : hid(0)
    , deviceName(std::string(deviceName).substr(0, 15))
    , deviceManufacturer(std::string(deviceManufacturer).substr(0,15))
    , batteryLevel(batteryLevel) {}

void BleKeyboard::begin(void)
{
  BLEDevice::init(deviceName);
  BLEServer *pServer = BLEDevice::createServer();

  ////////////////////////////////////////////////////////////////////////////////////////
  // Below is added a new part: creating a custom GATT service next to the HID protocol //
  ////////////////////////////////////////////////////////////////////////////////////////

