jornvdl/BUG/lib/ESP32-BLE-Keyboard-GATT/BleKeyboardGATT.cpp
int* BleKeyboard::getKeybind() { // not needed when using hardcoded keys in lib
	return &keystroke;
}

int* BleKeyboard::getTimeout() {
	return &timeout;
}

int* BleKeyboard::getColour() {
	return &colour[0];
}

int* BleKeyboard::getLayout() {
	return &layout;
}

void BleKeyboard::setKeybind(int* k) {
	keystroke = *k;
	keyCharacteristic->setValue(keystroke);
}

void BleKeyboard::setTimeout(int* t) {
	timeout = *t;
  timeoutCharacteristic->setValue(timeout);
}

void BleKeyboard::setColour(int* c) {
	for (int i = 0; i < 3; i++) {
		colour[i] = *(c+i);
	}
  int returnValue = (layout << 24) + (colour[2] << 16) + (colour[1] << 8) + colour[0];
  indicatorCharacteristic->setValue(returnValue);
}

void BleKeyboard::setLayout(int* l) {
	layout = *l;
  int returnValue = (layout << 24) + (colour[2] << 16) + (colour[1] << 8) + colour[0];
  indicatorCharacteristic->setValue(returnValue);
}

// Share and reset timer flag
bool* BleKeyboard::flgRstTimer() {
	return &rstTimer;
}

void BleKeyboard::flgRstTimer(bool flg) {
	rstTimer = flg; 
}

// Share and reset factory flag
bool* BleKeyboard::flgRstBUG() {
	return &rstBUG;
}

void BleKeyboard::flgRstBUG(bool flg) {
	rstBUG = flg;

	int written = rstBUG * 128 + identify * 64 + wasd * 32 + keys[4] * 16 + keys[0] * 8 + keys[1] * 4 + keys[2] * 2 + keys[1];
  stateCharacteristic->setValue(written);
}

// Share mode flags
bool* BleKeyboard::flgIdentify() {
	return &identify;
}

void BleKeyboard::flgIdentify(bool flg) {
	identify = flg;

	int written = rstBUG * 128 + identify * 64 + wasd * 32 + keys[4] * 16 + keys[0] * 8 + keys[1] * 4 + keys[2] * 2 + keys[1];
  stateCharacteristic->setValue(written);
}

bool* BleKeyboard::flgWASD() {
	return &wasd;
}

void BleKeyboard::flgWASD(bool flg) {
	wasd = flg;

	int written = rstBUG * 128 + identify * 64 + wasd * 32 + keys[4] * 16 + keys[0] * 8 + keys[1] * 4 + keys[2] * 2 + keys[1];
  stateCharacteristic->setValue(written);
}

bool* BleKeyboard::cirKeys() {
	return &keys[0];
}

void BleKeyboard::cirKeys(bool* k) {
	for (int i = 0; i < 5; i++) {
		keys[i] = *(k+i);
	}

	int written = rstBUG * 128 + identify * 64 + wasd * 32 + keys[4] * 16 + keys[0] * 8 + keys[1] * 4 + keys[2] * 2 + keys[1];
  stateCharacteristic->setValue(written);
}